'number' + 23 + 32
'number2332' 
// Це Конкетинація, тому що один з операндів є строкою, і так як він перший, то подальщі операнди не сумуються.

41 + 1 + 'number'
'42number' 
// Конкетинація, але все що йде до операнда 'строка' сумуютється.

null + 1
1
// Тому що null - це порожнє значення.

'five' + + 'two'
'fiveNaN'
// Перший "+" операція додавання, другий "+" операція перетворення строки 'two' в число, робимо додавання після перетворення тим самим видає NaN і Конкетинація.

2 && 7
7
// Оператор && переводить числа в булеве значення, всі числа крім "0" вважаються true, Так як 2 та 7 у нас true, повертається останнє значення.

+ '40' + + '2'
42
// Унарний + переводить строку '40' в число, так само строку '2' в число, потім складання двох чисел 40 + 2.

'10' - 5 === 6
false
// Переведення '10' в число, потім результат порівнюється, 5 не строго дорівнює 6.

true + false
1
// Так як у нас арифметична операція, тоді true і false перетворюються в числа (true = 1, false = 0) та сумуються.

'4px' - 3
Nan
// Строка переводиться в число, 'px' не є числом, тому NaN, люба операція з NaN повертає NaN.

'4' - 3
1
// Строка переводиться у число та віднімається.

'2' + 3 ** 2
'29'
// Конкетизація, після зведення у ступінь 

12 / '6'
NaN 
// Тому що число не ділиться на строку.

23 + 42 + 'number'
'65number'
// Конкетинація, але все що йде до операнда 'строка' сумуютється.

'10' + (5 === 6)
'10false'
// Конкетинація після дії в дужках, 5 не строго дорівнює 6, тому false.

'number' + 15 + 3
'number153' 
// Це Конкетинація, тому що один з операндів є строкою, і так як він перший, то подальщі операнди не сумуються.
// dsd